# setup shell and core tools first
brew "git"
brew "git-lfs"
brew "wget"
brew "zsh"

# everything else
brew "ack"
brew "awscli"
brew "bandwhich"
brew "bat"
brew "bottom"
brew "btop"
brew "circleci"
brew "clipper"
brew "dust"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "git-delta"
brew "gnupg"
brew "go"
brew "grc"
brew "grex"
brew "hyperfine"
brew "jq"
brew "lf"
brew "procs"
brew "python"
brew "rcm"
brew "rg"
brew "sd"
brew "starship"
brew "stylua"
brew "tealdeer"
brew "tmux"
brew "trash"
brew "tree"
brew "universal-ctags"
brew "yq"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

cask "ghostty"

cask "font-symbols-only-nerd-font"

# server tools
brew "redis"
brew "postgresql@14"

# taps
tap "jesseduffield/lazygit"
brew "lazygit"

tap "heroku/brew"
brew "heroku"

tap "stripe/stripe-cli"
brew "stripe"

tap "jacobwgillespie/tap"
brew "git-sync"

tap "qmk/qmk"
brew "qmk"
