# formulae
brew "ack"
brew "agg"
brew "asciinema"
brew "awscli"
brew "bandwhich"
brew "bat"
brew "bottom"
brew "btop"
brew "circleci"
brew "dust"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "gifsicle"
brew "git"
brew "difftastic"
brew "git-lfs"
brew "glow"
brew "gnupg"
brew "go"
brew "grc"
brew "grex"
brew "hyperfine"
brew "jq"
brew "lf"
brew "pandoc"
brew "procs"
brew "python"
brew "rcm"
brew "rg"
brew "sd"
brew "starship"
brew "tealdeer"
brew "tmux"
brew "tokei"
brew "tree"
brew "universal-ctags"
brew "wget"
brew "worktrunk"
brew "yq"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# casks
cask "font-jetbrains-mono-nerd-font"
cask "font-noto-color-emoji"
cask "font-noto-emoji"
cask "font-symbols-only-nerd-font"
cask "ghostty"

# taps
tap "heroku/brew"
brew "heroku"

tap "jesseduffield/lazygit"
brew "lazygit"

tap "qmk/qmk"
brew "qmk"

tap "stripe/stripe-cli"
brew "stripe"

tap "wassimk/tap"
brew "elgato-light"

tap "zhubert/tap"
brew "tokencoach"
