# setup shell and core tools first
brew "git"
brew "wget"
brew "zsh"

# everything else
brew "ack"
brew "awscli"
brew "bandwhich"
brew "bat"
brew "bottom"
brew "clipper"
brew "dust"
brew "exa"
brew "gh"
brew "git-delta"
brew "gnupg"
brew "go"
brew "grc"
brew "grex"
brew "heroku"
brew "hub"
brew "hyperfine"
brew "jesseduffield/lazygit/lazygit"
brew "jq"
brew "lazygit"
brew "lf"
brew "procs"
brew "python"
brew "rbenv"
brew "rcm"
brew "sd"
brew "starship"
brew "stripe"
brew "tealdeer"
brew "tmux"
brew "trash"
brew "tree"
brew "universal-ctags"
brew "yq"
brew "zoxide"
brew "zsh-syntax-highlighting"
